# Задание1. Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

# import random
# n = int(input("Введите n: "))
# a = []
# for i in range(n):
#     a.append(random.randint(1,10))
# print(a)
# x = int(input("Введите искомое число: "))
# count = 0
# for i in a:
#     if (i==x) :
#         count=count+1
# print(count)

# Задание2. Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

# import random
# n = int(input("Введите n: "))
# a = []
# for i in range(n):
#     a.append(random.randint(1,10))
# print(a)
# x = int(input("Введите искомое число: "))
# razn = abs(a[0]-x)
# elem = a[0]
# for i in range(1,len(a)):
#     if (abs(a[i]-x)<razn):
#         razn = abs(a[i]-x)
#         elem = a[i]
# print(elem)

# Задание3. В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность. 
# В случае с английским алфавитом очки распределяются так:A, E, I, O, U, L, N, S, T, R – 1 очко; 
# D, G – 2 очка; B, C, M, P – 3 очка; F, H, V, W, Y – 4 очка; K – 5 очков; J, X – 8 очков; 
# Q, Z – 10 очков. А русские буквы оцениваются так: А, В, Е, И, Н, О, Р, С, Т – 1 очко; 
# Д, К, Л, М, П, У – 2 очка; Б, Г, Ё, Ь, Я – 3 очка; Й, Ы – 4 очка; Ж, З, Х, Ц, Ч – 5 очков; 
# Ш, Э, Ю – 8 очков; Ф, Щ, Ъ – 10 очков. Напишите программу, которая вычисляет стоимость 
# введенного пользователем слова. Будем считать, что на вход подается только одно слово, 
# которое содержит либо только английские, либо только русские буквы.

dict = {'A, E, I, O, U, L, N, S, T, R, А, В, Е, И, Н, О, Р, С, Т': '1',
           'D, G, Д, К, Л, М, П, У':'2',
           'B, C, M, P, Б, Г, Ё, Ь, Я':'3',
           'F, H, V, W, Y, Й, Ы':'4',
           'K, Ж, З, Х, Ц, Ч':'5',
           'J, X, Ш, Э, Ю':'8',
           'Q, Z, Ф, Щ, Ъ':'10',
           }
word = input("Введите слово: ").upper()
sum = 0
for sym in word:
    for item in dict:
        if sym in item:
            sum = sum + int(dict[item])
print(f"{sum} очков")